<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"5c137e753bc4f9bbedaab00e4579d3af66fada1d3fbedb32627dc85a21ae9919","plan_job_ref":"Job TF Plan #8 at https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4729477444","plan_hash":"9cbf670a1aeaa558694717f72af72f39d50241c64ca5b5763a00b1454aabdbe4","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __secure-linux-jump__
With backend config: `resource_group_name=ampe-state-sandbox-resourcegroup-nwqlx-rg
storage_account_name=ampestatesandboxsadojob
container_name=ampe-state-sandbox-sc-ndkad-stct
key=slj.terraform.tfstate`
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_bastion_host.azbas will be created
  + resource "azurerm_bastion_host" "azbas" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "AMPE-dev-linux-vm-azure-bastion-pgyul-bast"
      + resource_group_name    = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_network_security_group.nsg1a will be created
  + resource "azurerm_network_security_group" "nsg1a" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "AMPE-dev-linux-vm-nsg1a-pmfam-nsg"
      + resource_group_name = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "initial-testing"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "AMPE-dev-linux-vm-pip-fqoxj-pip"
      + resource_group_name     = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_subnet.snet1a will be created
  + resource "azurerm_subnet" "snet1a" {
      + address_prefixes                               = [
          + "10.0.0.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AMPE-dev-linux-vm-subnet1a-mrasf-snet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + virtual_network_name                           = "AMPE-dev-linux-vm-virtualnet1-fltei-vnet"
    }

  # azurerm_virtual_network.vnet1 will be created
  + resource "azurerm_virtual_network" "vnet1" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "AMPE-dev-linux-vm-virtualnet1-fltei-vnet"
      + resource_group_name = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #8](https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4729477444)